kenchaan/PicWorking/project/WinkerFader/source/WinkerFader.X/source/PIC16F886_hardware_ccp.c
/*******************************************************************************
*	Author		|	Date		|	FileName
*-------------------------------------------------------------------------------
*	kenchaan	|	2020/01/13	|	PIC16F886_hardware_ccp.c
*-------------------------------------------------------------------------------
*	Description	|	[PIC16F886]CCP制御
*-------------------------------------------------------------------------------
*	Copyright (c) 2020 kenchaan All Rights Reserved.
*******************************************************************************/

/*------------------------------------------------------------------------------
*	include
*-----------------------------------------------------------------------------*/
#include <xc.h>
#include "types.h"
#include "regaccess.h"
#include "hardware.h"
#include "hardware_timer.h"
#include "hardware_port.h"
#include "hardware_ccp.h"

/*------------------------------------------------------------------------------
*	pragma
*-----------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
*	define
*-----------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
*	macro
*-----------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
*	typedef
*-----------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
*	enum
*-----------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
*	struct
*-----------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
*	static variable
*-----------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
*	static function prototype
*-----------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
*	static const data
*-----------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
*	extern const data
*-----------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
*	function
*-----------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------
* OverView	: CCP初期化
* Parameter	: None
* Return	: None
*-----------------------------------------------------------------------------*/
void HW_CCP_Initialize( void )
{
	/* CCP1 */
	REG_WRITE_08( CCP1CON, 0x3C );
	REG_WRITE_08( CCPR1L, 0x20 );

	/* CCP2 */
	REG_WRITE_08( CCP2CON, 0x00 );
}

/*------------------------------------------------------------------------------
* OverView	: 点滅設定
* Parameter	: isEnable	: TRUE:有効 FALSE:無効
* Return	: None
*-----------------------------------------------------------------------------*/
void HW_CCP_EnableFlash( const BOOL isEnable )
{
	HW_TIM_EnableTimer( eTIMER_TYPE_TMR2, isEnable );
	if( !isEnable ){
		HW_PORT_Set( eOUTPUT_PORT_PWM, FALSE );
	}
}

/*------------------------------------------------------------------------------
* OverView	: ポート状態取得
* Parameter	: duty	: デューティ比(%)
* Return	: None
*-----------------------------------------------------------------------------*/
void HW_CCP_SetDuty( const U08 duty )
{
	if( duty == 0 ){
		REG_RMW_08( CCP1CON, 0x30, 0x00 );
		REG_WRITE_08( CCPR1L, 0x00 );
	}else if( duty >= 100 ){
		REG_RMW_08( CCP1CON, 0x30, 0x30 );
		REG_WRITE_08( CCPR1L, 0xFF );
	}else{
		U16 width = (U16)( (F32)( TMR2_PERIOD * 4 ) * (F32)( (F32)duty / 100.0 ));
		REG_RMW_08( CCP1CON, 0x30, (U08)( (U08)( width & 0x03 ) << 4 ));
		REG_WRITE_08( CCPR1L, (U08)( width >> 2 ));
	}
}


/*------------------------------------------------------------------------------
*	End Of File
*-----------------------------------------------------------------------------*/
